Final edits to the README
